Public Member Functions | List of all members
ACAPI::MEP::RoutingElementDefault::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingElementDefault. More...
#include <MEPRoutingElementDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingElementDefault::Modifier:
 Public Member Functions
void  | SetRoutingSegmentDefault (const RoutingSegmentDefault &routingSegmentDefault)
Sets the RoutingSegmentDefault of RoutingElement.
void  | SetRoutingNodeDefault (const RoutingNodeDefault &routingNodeDefault)
Sets the RoutingNodeDefault of RoutingElement.
Result< void >  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of RoutingElement.
Result< void >  | SetBranchPreferenceTableId (const UniqueID &uniqueId)
Sets the Branch PreferenceTable of the RoutingElementDefault.
Result< void >  | SetFloorPlanDisplayOption (FloorPlanDisplayOption floorPlanDisplayOption)
Sets the Floor Plan Display Option of the RoutingElementDefault.
void  | SetCutPlanePosition (CutPlanePosition cutPlanePos)
Sets the Cut Plane Position of the RoutingElementDefault.
Result< void >  | SetShowProjection (ShowProjection showProjection)
Sets the Show Projection setting of the RoutingElementDefault.
void  | SetOnStoryVisibility (OnStoryVisibility onStoryVisibility)
Sets the Story Visibility of the RoutingElementDefault.
Detailed Description
Modifier of the RoutingElementDefault.
Member Function Documentation
◆ SetBranchPreferenceTableId()
 Result< void > ACAPI::MEP::RoutingElementDefault::Modifier::SetBranchPreferenceTableId  |  ( |  const UniqueID & |  uniqueId | )
Sets the Branch PreferenceTable of the RoutingElementDefault.
Parameters
uniqueId | The UniqueID of the Branch PreferenceTable.
Returns
Returns an error if the parameter does not identify a Branch PreferenceTable, otherwise nothing.
◆ SetCutPlanePosition()
 void ACAPI::MEP::RoutingElementDefault::Modifier::SetCutPlanePosition  |  ( |  CutPlanePosition |  cutPlanePos | )
Sets the Cut Plane Position of the RoutingElementDefault.
Parameters
cutPlanePos | The Cut Plane Position to be set.
◆ SetFloorPlanDisplayOption()
 Result< void > ACAPI::MEP::RoutingElementDefault::Modifier::SetFloorPlanDisplayOption  |  ( |  FloorPlanDisplayOption |  floorPlanDisplayOption | )
Sets the Floor Plan Display Option of the RoutingElementDefault.
Parameters
floorPlanDisplayOption | The Floor Plan Display Option to be set.
Returns
Returns an error if the cut plane position is set to 'By Upper Display Limit' and we try to pass a 'Projected With Overhead' floor plan display option, otherwise nothing
◆ SetMEPSystem()
 Result< void > ACAPI::MEP::RoutingElementDefault::Modifier::SetMEPSystem  |  ( |  const API_AttributeIndex & |  attributeIndex | )
Sets the MEPSystem attribute of RoutingElement.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
Returns
The result of the setting.
◆ SetOnStoryVisibility()
 void ACAPI::MEP::RoutingElementDefault::Modifier::SetOnStoryVisibility  |  ( |  OnStoryVisibility |  onStoryVisibility | )
Sets the Story Visibility of the RoutingElementDefault.
Parameters
onStoryVisibility | The Story Visibility setting to be set.
◆ SetRoutingNodeDefault()
 void ACAPI::MEP::RoutingElementDefault::Modifier::SetRoutingNodeDefault  |  ( |  const RoutingNodeDefault & |  routingNodeDefault | )
Sets the RoutingNodeDefault of RoutingElement.
Parameters
routingNodeDefault | The default to be set.
◆ SetRoutingSegmentDefault()
 void ACAPI::MEP::RoutingElementDefault::Modifier::SetRoutingSegmentDefault  |  ( |  const RoutingSegmentDefault & |  routingSegmentDefault | )
Sets the RoutingSegmentDefault of RoutingElement.
Parameters
routingSegmentDefault | The default to be set.
◆ SetShowProjection()
 Result< void > ACAPI::MEP::RoutingElementDefault::Modifier::SetShowProjection  |  ( |  ShowProjection |  showProjection | )
Sets the Show Projection setting of the RoutingElementDefault.
Parameters
showProjection | The Show Projection setting to be set.
Returns
Returns an error if the FloorPlanDisplayOption is set to Symbolic, otherwise nothing.